[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if (faces < 2) {
-            this._faces = 6;
-        }
-        else {
-            this._faces = faces;
-            
-        }
-        this._distribution = new Map<number, number>();
-        // console.log(this._distribution,"this is distribution");
-        for (let i: number = 0; i < this._faces; i++) {
-            
-            this._distribution.set(i, 0);
-        }
-        this._last = 0;
-    }
+    constructor(faces: number) {}
     // specifies which number should be rolled and returns the recorded roll. 
     // If the value provided is not valid for the number of faces the die has,
killedBy: Roller tests Roller class testing the constructor should set _faces to 6 if the argument is less than 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:13:14
         if (faces < 2) {
             this._faces = 6;
         }
-        else {
-            this._faces = faces;
-            
-        }
+        else {}
         this._distribution = new Map<number, number>();
         // console.log(this._distribution,"this is distribution");
killedBy: Roller tests Roller class testing the constructor it should set _faces to the given value if it is valid and within the allowed range
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: undefined

[Killed] ConditionalExpression
src/Roller.ts:19:33
         }
         this._distribution = new Map<number, number>();
         // console.log(this._distribution,"this is distribution");
-        for (let i: number = 0; i < this._faces; i++) {
+        for (let i: number = 0; false; i++) {
             
             this._distribution.set(i, 0);
killedBy: Roller tests Roller class testing the roll functionality roll should update the distribution record for the provided value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: NaN

[Killed] BlockStatement
src/Roller.ts:19:55
         }
         this._distribution = new Map<number, number>();
         // console.log(this._distribution,"this is distribution");
-        for (let i: number = 0; i < this._faces; i++) {
-            
-            this._distribution.set(i, 0);
-        }
+        for (let i: number = 0; i < this._faces; i++) {}
         this._last = 0;
     }
killedBy: Roller tests Roller class testing the roll functionality roll should update the distribution record for the provided value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: NaN

[Killed] BlockStatement
src/Roller.ts:35:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if (value < 1 || value > this._faces) {
-            return 0;
-        }
-        else {
-            this._last = value;
-            let val = this._distribution.get(value);
-            val++;
-            this._distribution.set(value, val);
-            
-        }
-        return value;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests Roller class testing the roll functionality roll should return 0 if the provided value is not valid testing with alot of improper values
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/Roller.ts:39:14
         if (value < 1 || value > this._faces) {
             return 0;
         }
-        else {
-            this._last = value;
-            let val = this._distribution.get(value);
-            val++;
-            this._distribution.set(value, val);
-            
-        }
+        else {}
         return value;
     }
killedBy: Roller tests Roller class testing the roll functionality roll the roller class should be able to store the last value rolled and then return it when last is called
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 5
Received: 0

[Killed] UpdateOperator
src/Roller.ts:42:13
         else {
             this._last = value;
             let val = this._distribution.get(value);
-            val++;
+            val--;
             this._distribution.set(value, val);
             
killedBy: Roller tests Roller class testing the roll functionality roll should update the distribution record for the provided value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BlockStatement
src/Roller.ts:64:25
         return this._distribution;
     }
     // additional functionality to help with testing 
-    get_faces(): number {
-        return this._faces;
-    }
+    get_faces(): number {}
 
 
killedBy: Roller tests Roller class testing the constructor should set _faces to 6 if the argument is less than 2
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 6
Received: undefined
